app/controllers/users_controller.rb

  def create
  	@user = User.create(username: params[:username],email: params[:email],bio: params[:bio])
---
INSERT INTO "users" ("username", "email", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "Mathieu"], ["email", "doniermathieu@gmail.com"], ["bio", "Blabla"], ["created_at", "2018-10-30 10:34:55.166480"], ["updated_at", "2018-10-30 10:34:55.166480"]]

  def show
  	@username = User.find_by(username: params[:username]).username
  	@email = User.find_by(email: params[:email]).email
  	@bio = User.find_by(bio: params[:bio]).bio
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Mathieu"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."bio" IS NULL LIMIT $1  [["LIMIT", 1]]